openfoam/templates/wind_tunnel_openjet/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Open-jet wind tunnel (Westenberg WT 8600100-E).
// Flow in +Z direction.  V_INF_MS substituted by generate_case.py.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 V_INF_MS);

boundaryField
{
    propeller
    {
        type            noSlip;
    }

    inlet
    {
        // Uniform jet velocity at nozzle exit
        type            fixedValue;
        value           uniform (0 0 V_INF_MS);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 V_INF_MS);
        value           uniform (0 0 V_INF_MS);
    }

    sides
    {
        // Slip approximates the free-jet boundary (zero shear stress)
        type            slip;
    }
}

// ************************************************************************* //
