openfoam/templates/wind_tunnel_openjet/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Kinematic pressure [m²/s²]  (p/rho for incompressible solver)

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    propeller
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        // Fixed reference pressure at domain exit
        type            fixedValue;
        value           uniform 0;
    }

    sides
    {
        type            slip;
    }
}

// ************************************************************************* //
